Scenarios/REST/k6-load-tests/results/java25/scenario1-virtual-threads-cache/k6-summary.txt
jromero@MC02DW3HTMD6P k6-load-tests % k6 run scenario-1-read-heavy.js --out json=results/java25/scenario1-virtual-threads-cache/k6-out.json

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: scenario-1-read-heavy.js
        output: json (results/java25/scenario1-virtual-threads-cache/k6-out.json)

     scenarios: (100.00%) 1 scenario, 500 max VUs, 14m30s max duration (incl. graceful stop):
              * default: Up to 500 looping VUs for 14m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

INFO[0000] ========================================      source=console
INFO[0000] TEST START TIME                               source=console
INFO[0000] ========================================      source=console
INFO[0000] ISO Format: 2026-02-26T18:05:47.386Z          source=console
INFO[0000] Epoch (ms): 1772129147386                     source=console
INFO[0000] Running setup - checking application health...  source=console
INFO[0841] ========================================      source=console
INFO[0841] TEST END TIME                                 source=console
INFO[0841] ========================================      source=console
INFO[0841] ISO Format: 2026-02-26T18:19:48.897Z          source=console
INFO[0841] Epoch (ms): 1772129988897                     source=console
INFO[0841] Running teardown - checking application health...  source=console
INFO[0841] ========================================      source=console
INFO[0841] TEST DURATION: 841.511 seconds (14.03 minutes)  source=console
INFO[0841] ========================================      source=console
INFO[0841]
========== Read-Heavy Scenario ==========    source=console
INFO[0841] Start time: 2026-02-26T18:05:47.386Z          source=console
INFO[0841] End time: 2026-02-26T18:19:48.897Z            source=console
INFO[0841] Duration: 841.511 seconds                     source=console
INFO[0841] =======================================       source=console


  █ THRESHOLDS

    http_req_duration
    ✗ 'p(99)<1000' p(99)=5.66s
    ✗ 'p(95)<500' p(95)=4.33s
    ✗ 'p(50)<100' p(50)=828.47ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    http_reqs
    ✓ 'count>0' count=69509


  █ TOTAL RESULTS

    checks_total.......: 139016 165.180751/s
    checks_succeeded...: 69.33% 96387 out of 139016
    checks_failed......: 30.66% 42629 out of 139016

    ✓ Health check status is 200
    ✓ GET /customers/{id} status is 200
    ✗ GET /customers/{id} response time < 500ms
      ↳  45% — ✓ 18831 / ✗ 22740
    ✓ POST /customers status is 201 or 200
    ✗ POST /customers response time < 500ms
      ↳  44% — ✓ 6170 / ✗ 7783
    ✓ GET /customers?search status is 200
    ✗ GET /customers?search response time < 500ms
      ↳  13% — ✓ 1877 / ✗ 12106

    HTTP
    http_req_duration..............: avg=1.36s min=34.4ms  med=828.47ms max=15.14s p(90)=3.55s p(95)=4.33s
      { expected_response:true }...: avg=1.36s min=34.4ms  med=828.47ms max=15.14s p(90)=3.55s p(95)=4.33s
    http_req_failed................: 0.00% 0 out of 69509
    http_reqs......................: 69509 82.591564/s

    EXECUTION
    iteration_duration.............: avg=2.85s min=82.96ms med=2.47s    max=16.37s p(90)=5.14s p(95)=5.95s
    iterations.....................: 69507 82.589188/s
    vus............................: 2     min=1          max=500
    vus_max........................: 500   min=500        max=500

    NETWORK
    data_received..................: 11 GB 13 MB/s
    data_sent......................: 12 MB 14 kB/s



running (14m01.6s), 000/500 VUs, 69507 complete and 0 interrupted iterations
default ✓ [======================================] 000/500 VUs  14m0s
ERRO[0841] thresholds on metrics 'http_req_duration' have been crossed